In [1]:
import pandas as pd
# xlsx data is in the form of excel

df=pd.read_excel("data/stddata.xlsx")

In [2]:
print(df.head())

   regno  name   phone address    m1    m2    m3    m4
0    101  anand    999     hyd  87.0  55.0   NaN  44.0
1    105    aaa    555     vij  77.0  66.0  99.0  99.0
2    109    rrr    444     vik   NaN  78.0  88.0  88.0
3    107    sss    888     sec  69.0  85.0  58.0   NaN
4    102    bbb    111     ant  89.0   NaN  99.0  99.0

In [3]:
print(df.isnull().sum())

regno      0
name       1
phone      0
address    1
m1         2
m2         1
m3         2
m4         3
dtype: int64

In [4]:
df.m1=df.m1.fillna(df.m1.mean())
df.m2=df.m2.fillna(df.m2.mean())
df.m3=df.m3.fillna(df.m3.mean())
df.m4=df.m4.fillna(df.m4.mean())

In [6]:
print(df.isnull().sum())

regno      0
name       1
phone      0
address    1
m1         0
m2         0
m3         0
m4         0
dtype: int64

# rows

In [8]:
print(df.dropna())
# after dropna i.e it removes nan value of entire row

   regno  name   phone address    m1    m2    m3         m4
0    101  anand    999     hyd  87.0  55.0  86.0  44.000000
1    105    aaa    555     vij  77.0  66.0  99.0  99.000000
2    109    rrr    444     vik  76.0  78.0  88.0  88.000000
3    107    sss    888     sec  69.0  85.0  58.0  80.142857
4    102    bbb    111     ant  89.0  72.0  99.0  99.000000
5    201  anand    999     hyd  87.0  55.0  86.0  44.000000
6    202    aaa    555     vij  76.0  66.0  99.0  80.142857
7    203    rrr    444     vik  89.0  78.0  88.0  88.000000
9    205    bbb    111     ant  77.0  88.0  99.0  99.000000

In [9]:
print(df.head(14))

   regno  name   phone address    m1    m2    m3         m4
0    101  anand    999     hyd  87.0  55.0  86.0  44.000000
1    105    aaa    555     vij  77.0  66.0  99.0  99.000000
2    109    rrr    444     vik  76.0  78.0  88.0  88.000000
3    107    sss    888     sec  69.0  85.0  58.0  80.142857
4    102    bbb    111     ant  89.0  72.0  99.0  99.000000
5    201  anand    999     hyd  87.0  55.0  86.0  44.000000
6    202    aaa    555     vij  76.0  66.0  99.0  80.142857
7    203    rrr    444     vik  89.0  78.0  88.0  88.000000
8    204    NaN    888     NaN  33.0  77.0  58.0  80.142857
9    205    bbb    111     ant  77.0  88.0  99.0  99.000000

In [11]:
print(df.dropna(how="all")) 
# how='all' i.e if total row is having nan values then it removes entire row

   regno  name   phone address    m1    m2    m3         m4
0    101  anand    999     hyd  87.0  55.0  86.0  44.000000
1    105    aaa    555     vij  77.0  66.0  99.0  99.000000
2    109    rrr    444     vik  76.0  78.0  88.0  88.000000
3    107    sss    888     sec  69.0  85.0  58.0  80.142857
4    102    bbb    111     ant  89.0  72.0  99.0  99.000000
5    201  anand    999     hyd  87.0  55.0  86.0  44.000000
6    202    aaa    555     vij  76.0  66.0  99.0  80.142857
7    203    rrr    444     vik  89.0  78.0  88.0  88.000000
8    204    NaN    888     NaN  33.0  77.0  58.0  80.142857
9    205    bbb    111     ant  77.0  88.0  99.0  99.000000

In [13]:
print(df.dropna(thresh=6))
# if row has less than 6 values of nan it  removes the total row

   regno  name   phone address    m1    m2    m3         m4
0    101  anand    999     hyd  87.0  55.0  86.0  44.000000
1    105    aaa    555     vij  77.0  66.0  99.0  99.000000
2    109    rrr    444     vik  76.0  78.0  88.0  88.000000
3    107    sss    888     sec  69.0  85.0  58.0  80.142857
4    102    bbb    111     ant  89.0  72.0  99.0  99.000000
5    201  anand    999     hyd  87.0  55.0  86.0  44.000000
6    202    aaa    555     vij  76.0  66.0  99.0  80.142857
7    203    rrr    444     vik  89.0  78.0  88.0  88.000000
8    204    NaN    888     NaN  33.0  77.0  58.0  80.142857
9    205    bbb    111     ant  77.0  88.0  99.0  99.000000

# columns

In [14]:
print(df.head(14))

   regno  name   phone address    m1    m2    m3         m4
0    101  anand    999     hyd  87.0  55.0  86.0  44.000000
1    105    aaa    555     vij  77.0  66.0  99.0  99.000000
2    109    rrr    444     vik  76.0  78.0  88.0  88.000000
3    107    sss    888     sec  69.0  85.0  58.0  80.142857
4    102    bbb    111     ant  89.0  72.0  99.0  99.000000
5    201  anand    999     hyd  87.0  55.0  86.0  44.000000
6    202    aaa    555     vij  76.0  66.0  99.0  80.142857
7    203    rrr    444     vik  89.0  78.0  88.0  88.000000
8    204    NaN    888     NaN  33.0  77.0  58.0  80.142857
9    205    bbb    111     ant  77.0  88.0  99.0  99.000000

In [15]:
print(df.dropna(subset=['m1']))  
#it removes the nan values of m1 column  of entire row

   regno  name   phone address    m1    m2    m3         m4
0    101  anand    999     hyd  87.0  55.0  86.0  44.000000
1    105    aaa    555     vij  77.0  66.0  99.0  99.000000
2    109    rrr    444     vik  76.0  78.0  88.0  88.000000
3    107    sss    888     sec  69.0  85.0  58.0  80.142857
4    102    bbb    111     ant  89.0  72.0  99.0  99.000000
5    201  anand    999     hyd  87.0  55.0  86.0  44.000000
6    202    aaa    555     vij  76.0  66.0  99.0  80.142857
7    203    rrr    444     vik  89.0  78.0  88.0  88.000000
8    204    NaN    888     NaN  33.0  77.0  58.0  80.142857
9    205    bbb    111     ant  77.0  88.0  99.0  99.000000

In [16]:
print(df.dropna(subset=['m1','m2','m3','m4']))

   regno  name   phone address    m1    m2    m3         m4
0    101  anand    999     hyd  87.0  55.0  86.0  44.000000
1    105    aaa    555     vij  77.0  66.0  99.0  99.000000
2    109    rrr    444     vik  76.0  78.0  88.0  88.000000
3    107    sss    888     sec  69.0  85.0  58.0  80.142857
4    102    bbb    111     ant  89.0  72.0  99.0  99.000000
5    201  anand    999     hyd  87.0  55.0  86.0  44.000000
6    202    aaa    555     vij  76.0  66.0  99.0  80.142857
7    203    rrr    444     vik  89.0  78.0  88.0  88.000000
8    204    NaN    888     NaN  33.0  77.0  58.0  80.142857
9    205    bbb    111     ant  77.0  88.0  99.0  99.000000

In [17]:
print(df.dropna(axis=1,how='all'))
# if total column has nan values it removes t.column

   regno  name   phone address    m1    m2    m3         m4
0    101  anand    999     hyd  87.0  55.0  86.0  44.000000
1    105    aaa    555     vij  77.0  66.0  99.0  99.000000
2    109    rrr    444     vik  76.0  78.0  88.0  88.000000
3    107    sss    888     sec  69.0  85.0  58.0  80.142857
4    102    bbb    111     ant  89.0  72.0  99.0  99.000000
5    201  anand    999     hyd  87.0  55.0  86.0  44.000000
6    202    aaa    555     vij  76.0  66.0  99.0  80.142857
7    203    rrr    444     vik  89.0  78.0  88.0  88.000000
8    204    NaN    888     NaN  33.0  77.0  58.0  80.142857
9    205    bbb    111     ant  77.0  88.0  99.0  99.000000

In [18]:
print(df.dropna(axis=1))
# if a column has 1 nan value total column will be removed

   regno  phone    m1    m2    m3         m4
0    101    999  87.0  55.0  86.0  44.000000
1    105    555  77.0  66.0  99.0  99.000000
2    109    444  76.0  78.0  88.0  88.000000
3    107    888  69.0  85.0  58.0  80.142857
4    102    111  89.0  72.0  99.0  99.000000
5    201    999  87.0  55.0  86.0  44.000000
6    202    555  76.0  66.0  99.0  80.142857
7    203    444  89.0  78.0  88.0  88.000000
8    204    888  33.0  77.0  58.0  80.142857
9    205    111  77.0  88.0  99.0  99.000000

In [19]:
print(df.dropna(axis=1,thresh=8)) # if a column has less than 8 values then t.column will be deleted

   regno  name   phone address    m1    m2    m3         m4
0    101  anand    999     hyd  87.0  55.0  86.0  44.000000
1    105    aaa    555     vij  77.0  66.0  99.0  99.000000
2    109    rrr    444     vik  76.0  78.0  88.0  88.000000
3    107    sss    888     sec  69.0  85.0  58.0  80.142857
4    102    bbb    111     ant  89.0  72.0  99.0  99.000000
5    201  anand    999     hyd  87.0  55.0  86.0  44.000000
6    202    aaa    555     vij  76.0  66.0  99.0  80.142857
7    203    rrr    444     vik  89.0  78.0  88.0  88.000000
8    204    NaN    888     NaN  33.0  77.0  58.0  80.142857
9    205    bbb    111     ant  77.0  88.0  99.0  99.000000